/*  Перше змінна оголошується, потім використовується */

/* 
    Перший варіант оголошення змінної let 
    можна присвоювати значення 
    міняти його 
*/ 

// Оголошення змінної, та присвоювання їй значення 
let message = 'Сайт працює!';

//  Вивід значення змінної в консоль
console.log(message);

// Зміна значення змінної
message = 'Сайт не працює';

// Вивід іншого значення змінної в консоль
console.log(message)

/* 
    Другий варіант оголошення змінної const 
    можна присвоювати значення
    змінювати значення не можна 
*/

const myName = 'Dmytro';

const age = 24;

console.log(myName);
console.log(age);

/* Правильні назви змінних */ 

const firstName = 'Dima';
const secondName = 'Haborak';
const ageUser = 24;

